---
kind: method
id: M:Autodesk.Revit.DB.Structure.AreaLoad.GetLoops
source: html/6d423e73-bd6a-aaa7-7818-84297f2a6e1b.htm
---
# Autodesk.Revit.DB.Structure.AreaLoad.GetLoops Method

Returns curve loops that define geometry of the area load.

## Syntax (C#)
```csharp
public IList<CurveLoop> GetLoops()
```